[
    {
        "title":"Use of Nest Web Cameras and Citizen Science to Quantify Osprey Prey Delivery Rate and Nest Success",
        "professor":"Harmony Dalgleish",
        "link":"https://wmit-pages-prod.s3.amazonaws.com/wp-content/uploads/sites/540/2024/03/27151459/Academia-and-Dalgleish-2022-Use-of-Nest-Web-Cameras-and-Citizen-Science-to-Quantify-Osprey-Prey-Delivery-Rate-and-Nest-Success.pdf",
        "description":"Ospreys' breeding success relies on ample fish deliveries to their nests, with success marked by raising at least one young to near-fledging age, a process monitored by citizen scientists through web cameras."
    },
    {
        "title":"Forecasting plant community impacts of climate variability and change: when do competitive interactions matter?",
        "professor":"Harmony Dalgleish",
        "link":"https://wmit-pages-prod.s3.amazonaws.com/wp-content/uploads/sites/540/2024/03/27151500/Adler-et-al.-2012-Forecasting-plant-community-impacts-of-climate-variability-and-change-when-do-competitive-interactions-matter.pdf",
        "description":"Changes in climate can impact a species' abundance both directly and through indirect interactions, but predicting the strength of these indirect effects remains challenging."
    },
    {
        "title":"Alternative methods do not provide support for the contribution of GM crops to monarch declines",
        "professor":"Harmony Dalgleish",
        "link":"https://wmit-pages-prod.s3.amazonaws.com/wp-content/uploads/sites/540/2024/03/27151502/Boyle-et-al.-2019-Reply-to-Wepprich-and-Ries-et-al.-Alternative-methods-do-not-provide-support-for-the-contribution-of-GM-crops-to-monarch-declines.pdf",
        "description":"Wepprich and Ries et al. critically engage with our study on monarch declines, suggesting alternative methodologies and highlighting the insufficiency of current data to accurately estimate monarch abundance trends over the past century, while agreeing that GM crops are unlikely a factor in these declines."
    },
    {
        "title":"Below-ground bud banks increase along a precipitation gradient of the North American Great Plains: a test of the meristem limitation hypothesis",
        "professor":"Harmony Dalgleish",
        "link":"https://wmit-pages-prod.s3.amazonaws.com/wp-content/uploads/sites/540/2024/03/27151503/Dalgleish-and-Hartnett-2006-Below-ground-bud-banks-increase-along-a-precipitation-gradient-of-the-North-American-Great-Plains-a-test-of-the-meristem-limitation-hypothesis.pdf",
        "description":"The study tested the 'meristem limitation hypothesis' by examining if bud banks increase with rising precipitation and productivity in North American grasslands, and evaluated their seasonal dynamics."
    },
    {
        "title":"The effects of fire frequency and grazing on tallgrass prairie productivity and plant composition are mediated through bud bank demography",
        "professor":"Harmony Dalgleish",
        "link":"https://wmit-pages-prod.s3.amazonaws.com/wp-content/uploads/sites/540/2024/03/27151505/Dalgleish-and-Hartnett-2009-The-effects-of-fire-frequency-and-grazing-on-tallgrass-prairie-productivity-and-plant-composition-are-mediated-through-bud-bank-demography.pdf",
        "description":"Long-term experiments at Konza Prairie Biological Station were conducted to investigate how fire and grazing influence the demographic mechanisms of tallgrass prairie ecosystems."
    },
    {
        "title":"A recent invasive population of the European starling sturnus vulgaris has lower genetic diversity and higher fluctuating asymmetry than primary invasive and native populations",
        "professor":"John Swaddle",
        "link":"https://0628d43b-6078-483b-b334-86c7ec05c51d.filesusr.com/ugd/4d6945_105e0b47c2104e7f9d5c649f80bd610c.pdf",
        "description":"The study examines the genetic diversity and fluctuating asymmetries (FA) of European starlings in England, USA, and Argentina, predicting that Argentinean starlings would exhibit the highest FA and lowest genetic diversity due to reduced genetic variation from their introduction history."
    },
    {
        "title":"Field testing an “acoustic lighthouse”: Combined acoustic and visual cues provide a multimodal solution that reduces avian collision risk with tall human-made structures",
        "professor":"John Swaddle",
        "link":"https://0628d43b-6078-483b-b334-86c7ec05c51d.filesusr.com/ugd/4d6945_3d99441a98f846878f794e9a1690ec30.pdf",
        "description":"The research article demonstrates that combining acoustic signals, specifically in the 4 to 6 kHz range, with visual cues significantly reduces avian collisions with tall structures."
    },
    {
        "title":"Temporal shifts in ostracode sexual dimorphism from the Late Cretaceous to the late Eocene of the U.S. Coastal Plain",
        "professor":"John Swaddle",
        "link":"https://0628d43b-6078-483b-b334-86c7ec05c51d.filesusr.com/ugd/4d6945_3462758dbdc643fc89e3ca8a0541e5db.pdf",
        "description":"This study examines the sexual dimorphism in cytheroid ostracode carapaces, particularly the elongation in males due to larger copulatory organs, and investigates how these patterns evolved and persisted in the U.S. Coastal Plain since the late Eocene, post-K/Pg mass extinction."
    }
]